apache/nuttx/arch/arm/src/lpc43xx/lpc43_can.c
/****************************************************************************
 * arch/arm/src/lpc43xx/lpc43_can.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <stdio.h>
#include <sys/types.h>
#include <stdint.h>
#include <stdbool.h>
#include <assert.h>
#include <errno.h>
#include <nuttx/debug.h>

#include <arch/board/board.h>
#include <nuttx/irq.h>
#include <nuttx/arch.h>
#include <nuttx/can/can.h>

#include "arm_internal.h"
#include "chip.h"
#include "lpc43_gpio.h"
#include "hardware/lpc43_can.h"
#include "hardware/lpc43_rgu.h"
#include "lpc43_ccu.h"
#include "lpc43_cgu.h"

#if defined(CONFIG_LPC43_CAN0) || defined(CONFIG_LPC43_CAN1)

#define CAN_MSG_OBJECTS_NUM    0x20
#define CAN_RX_OBJ_NUM         0x10
#define CAN_TX_OBJ_NUM         0x10

#define CAN_RX_OBJ_FIRST       0x01
#define CAN_RX_OBJ_LAST         (CAN_RX_OBJ_FIRST + CAN_RX_OBJ_NUM - 0x01)

#define CAN_TX_OBJ_FIRST       (CAN_RX_OBJ_LAST + 0x01)
#define CAN_TX_OBJ_LAST         (CAN_TX_OBJ_FIRST + CAN_TX_OBJ_NUM - 0x01)

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Configuration ************************************************************/

#ifdef CONFIG_LPC43_CAN0

/* A CAN bit rate must be provided */

#  ifndef CONFIG_LPC43_CAN0_BAUD
#    define CONFIG_LPC43_CAN0_BAUD 1000000
#   endif
#endif

#ifdef CONFIG_LPC43_CAN1

/* A CAN bit rate must be provided */

#  ifndef CONFIG_LPC43_CAN1_BAUD
#    define CONFIG_LPC43_CAN1_BAUD 1000000
#  endif
#endif

/* User-defined TSEG1 and TSEG2 settings may be used.
 *
 * CONFIG_LPC43_CAN_TSEG1 = the number of CAN time quanta in segment 1
 * CONFIG_LPC43_CAN_TSEG2 = the number of CAN time quanta in segment 2
 * CAN_BIT_QUANTA   = The number of CAN time quanta in on bit time
 */

#ifndef CONFIG_LPC43_CAN_TSEG1
#  define CONFIG_LPC43_CAN_TSEG1 12
#endif

#ifndef CONFIG_LPC43_CAN_TSEG2
#  define CONFIG_LPC43_CAN_TSEG2 4
#endif

#define CAN_BIT_QUANTA (CONFIG_LPC43_CAN_TSEG1 + CONFIG_LPC43_CAN_TSEG2 + 1)

/* Timing *******************************************************************/

/* CAN clock source is defined in board.h */

#define CAN_CLOCK_FREQUENCY(c) ((uint32_t)LPC43_CCLK / ((uint32_t)(c)))

/* CAN module clock must be less then 50 MHz */

#define CAN_CLKDIVVAL  0x05

/****************************************************************************
 * Private Types
 ****************************************************************************/

struct up_dev_s
{
  uint8_t port;   /* CAN port number */
  uint8_t clkdiv; /* CLKDIV register */
  uint32_t baud;  /* Configured baud */
  uint32_t base;  /* CAN register base address */
  uint8_t irq;    /* IRQ associated with this CAN */
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

/* CAN Register access */

#ifdef CONFIG_LPC43_CAN_REGDEBUG
static void can_printreg(uint32_t addr, uint32_t value);
#endif

static uint32_t can_getreg(struct up_dev_s *priv, int offset);
static void can_putreg(struct up_dev_s *priv, int offset, uint32_t value);

#ifdef CONFIG_LPC43_CAN_REGDEBUG
static uint32_t can_getcommon(uint32_t addr);
static void can_putcommon(uint32_t addr, uint32_t value);
#else
#  define can_getcommon(addr)        getreg32(addr)
#  define can_putcommon(addr, value) putreg32(value, addr)
#endif

/* CAN methods */

static void can_reset(struct can_dev_s *dev);
static int can_setup(struct can_dev_s *dev);
static void can_shutdown(struct can_dev_s *dev);
static void can_rxint(struct can_dev_s *dev, bool enable);
static void can_txint(struct can_dev_s *dev, bool enable);
static int can_ioctl(struct can_dev_s *dev, int cmd, unsigned long arg);
static int can_remoterequest(struct can_dev_s *dev, uint16_t id);
static int can_send(struct can_dev_s *dev, struct can_msg_s *msg);
static bool candev_txready(struct can_dev_s *dev);
static bool candev_txempty(struct can_dev_s *dev);

/* CAN interrupts */

#ifdef CONFIG_LPC43_CAN0
static int can0_interrupt(int irq, void *context, void *arg);
#endif
#ifdef CONFIG_LPC43_CAN1
static int can1_interrupt(int irq, void *context, void *arg);
#endif
static void can_interrupt(struct can_dev_s *dev);

/* Message Processing */

static void can_savemsg(struct up_dev_s *priv, struct can_hdr_s *hdr,
                        uint32_t *data);
static void can_readobj(struct up_dev_s *priv, uint32_t index);
static void can_invalobj(struct up_dev_s *priv, uint32_t index);
static void can_setuprxobj(struct up_dev_s *priv);

/* Initialization */

static int can_bittiming(struct up_dev_s *priv);

/****************************************************************************
 * Private Data
 ****************************************************************************/

static const struct can_ops_s g_canops =
{
  .co_reset         = can_reset,
  .co_setup         = can_setup,
  .co_shutdown      = can_shutdown,
  .co_rxint         = can_rxint,
  .co_txint         = can_txint,
  .co_ioctl         = can_ioctl,
  .co_remoterequest = can_remoterequest,
  .co_send          = can_send,
  .co_txready       = candev_txready,
  .co_txempty       = candev_txempty,
};

#ifdef CONFIG_LPC43_CAN0
static struct up_dev_s g_can0priv =
{
  .port   = 0,
  .clkdiv = CAN_CLKDIVVAL + 1,
  .baud   = CONFIG_LPC43_CAN0_BAUD,
  .base   = LPC43_CAN0_BASE,
  .irq    = LPC43M4_IRQ_CAN0,
};

