apache/nuttx/arch/arm/src/lpc43xx/lpc43_can.c
  /* Initialization finished, normal operation now. */

  regval  = can_getreg(priv, LPC43_CAN_CNTL_OFFSET);
  regval &= ~CAN_CNTL_INIT;
  can_putreg(priv, LPC43_CAN_CNTL_OFFSET, regval);

  while (can_getreg(priv, LPC43_CAN_CNTL_OFFSET) & CAN_CNTL_INIT);

#ifdef CONFIG_LPC43_CAN0
  if (priv->irq == LPC43M4_IRQ_CAN0)
    {
      ret = irq_attach(priv->irq, can0_interrupt, 0);
    }
#endif

#ifdef CONFIG_LPC43_CAN1
  if (priv->irq == LPC43M4_IRQ_CAN1)
    {
      ret = irq_attach(priv->irq, can1_interrupt, 0);
    }
#endif

  if (ret == OK)
    {
      up_enable_irq(priv->irq);

      /* Enable CAN interrupts within CAN module */

      regval = can_getreg(priv, LPC43_CAN_CNTL_OFFSET);
      regval |= (CAN_CNTL_IE | CAN_CNTL_SIE | CAN_CNTL_EIE);
      can_putreg(priv, LPC43_CAN_CNTL_OFFSET, regval);
    }

  return ret;
}

/****************************************************************************
 * Name: can_shutdown
 *
 * Description:
 *   Disable the CAN.  This method is called when the CAN device is closed.
 *   This method reverses the operation the setup method.
 *
 * Input Parameters:
 *   dev - An instance of the "upper half" can driver state structure.
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void can_shutdown(struct can_dev_s *dev)
{
  struct up_dev_s *priv = (struct up_dev_s *)dev->cd_priv;
  uint32_t regval;

  caninfo("CAN%d\n", priv->port);

  /* Stop operation mode */

  regval = can_getreg(priv, LPC43_CAN_CNTL_OFFSET);
  regval |= CAN_CNTL_INIT;
  can_putreg(priv, LPC43_CAN_CNTL_OFFSET, regval);

  /* Disable CAN interrupts */

  regval = can_getreg(priv, LPC43_CAN_CNTL_OFFSET);
  regval &= ~(CAN_CNTL_IE | CAN_CNTL_SIE | CAN_CNTL_EIE);
  can_putreg(priv, LPC43_CAN_CNTL_OFFSET, regval);

  up_disable_irq(priv->irq);

  /* Then detach the CAN interrupt handler. */

  irq_detach(priv->irq);
}

/****************************************************************************
 * Name: can_rxint
 *
 * Description:
 *   Call to enable or disable RX interrupts.
 *   This function is called two times: from can_open and can_close.
 *   Therefore this function enables and disables not only RX interrupts
 *   but all message objects.
 *
 * Input Parameters:
 *   dev - An instance of the "upper half" can driver state structure.
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void can_rxint(struct can_dev_s *dev, bool enable)
{
  struct up_dev_s *priv = (struct up_dev_s *)dev->cd_priv;

  if (enable == true)
    {
      can_setuprxobj(priv);
    }
  else
    {
      uint8_t i = 0;
      for (i = CAN_RX_OBJ_FIRST; i <= CAN_RX_OBJ_LAST; ++i)
        {
          can_invalobj(priv, i);
        }
    }
}

/****************************************************************************
 * Name: can_txint
 *
 * Description:
 *   Call to enable or disable TX interrupts.
 *
 * Input Parameters:
 *   dev - An instance of the "upper half" can driver state structure.
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void can_txint(struct can_dev_s *dev, bool enable)
{
  /* The TX interrupt is automatically enabled in can_send within a
   * message object.
   */
}

/****************************************************************************
 * Name: can_ioctl
 *
 * Description:
 *   All ioctl calls will be routed through this method
 *
 * Input Parameters:
 *   dev - An instance of the "upper half" can driver state structure.
 *
 * Returned Value:
 *   Zero on success; a negated errno on failure
 *
 ****************************************************************************/

static int can_ioctl(struct can_dev_s *dev, int cmd, unsigned long arg)
{
  caninfo("Fix me:Not Implemented\n");
  return 0;
}

/****************************************************************************
 * Name: can_remoterequest
 *
 * Description:
 *   Send a remote request
 *
 * Input Parameters:
 *   dev - An instance of the "upper half" can driver state structure.
 *
 * Returned Value:
 *   Zero on success; a negated errno on failure
 *
 ****************************************************************************/

static int can_remoterequest(struct can_dev_s *dev, uint16_t id)
{
  caninfo("Fix me:Not Implemented\n");
  return 0;
}

/****************************************************************************
 * Name: can_send
 *
 * Description:
 *    Send one can message.
 *
 *    One CAN-message consists of a maximum of 10 bytes.  A message is
 *    composed of at least the first 2 bytes (when there are no data bytes).
 *
 *    Byte 0:      Bits 0-7: Bits 3-10 of the 11-bit CAN identifier
 *    Byte 1:      Bits 5-7: Bits 0-2 of the 11-bit CAN identifier
 *                 Bit 4:    Remote Transmission Request (RTR)
 *                 Bits 0-3: Data Length Code (DLC)
 *    Bytes 2-10: CAN data
 *
 * Input Parameters:
 *   dev - An instance of the "upper half" can driver state structure.
 *
 * Returned Value:
 *   Zero on success; a negated errno on failure
 *
 ****************************************************************************/

static int can_send(struct can_dev_s *dev, struct can_msg_s *msg)
{
  struct up_dev_s *priv = (struct up_dev_s *)dev->cd_priv;
  uint32_t regval;
  uint32_t clz;
  uint32_t id;
  uint32_t dlc;
  uint8_t txobj;

  if (msg == NULL)
    {
      return ERROR;
    }

  regval = (can_getreg(priv, LPC43_CAN_MSGV2_OFFSET) & 0xffff);
  clz    = arm_clz(regval);

  if (clz == 0x10)
    {
      return ERROR;
    }

  txobj = CAN_TX_OBJ_LAST - clz + CAN_TX_OBJ_FIRST;
  DEBUGASSERT((txobj >= CAN_TX_OBJ_FIRST) && (txobj <= CAN_TX_OBJ_LAST));

  id = (uint32_t) msg->cm_hdr.ch_id;
  dlc = (uint32_t) msg->cm_hdr.ch_dlc;

  caninfo("CAN%d ID: %d DLC: %d\n",
          priv->port, msg->cm_hdr.ch_id, msg->cm_hdr.ch_dlc);

  can_putreg(priv, LPC43_CAN_IF1_MSK1_OFFSET, 0xffff);
  can_putreg(priv, LPC43_CAN_IF1_MSK2_OFFSET, 0xffff);

  regval = ((dlc & CAN_MCTRL_DLC_MASK) | CAN_MCTRL_EOB | CAN_MCTRL_TXRQST
                      | CAN_MCTRL_TXIE);
  can_putreg(priv, LPC43_CAN_IF1_MCTRL_OFFSET, regval);

  /* Write data to IF1 data registers */

  regval = msg->cm_data[0] + (msg->cm_data[1] << 8);
  can_putreg(priv, LPC43_CAN_IF1_DA1_OFFSET, regval);

  regval = msg->cm_data[2] + (msg->cm_data[3] << 8);
  can_putreg(priv, LPC43_CAN_IF1_DA2_OFFSET, regval);

  regval = msg->cm_data[4] + (msg->cm_data[5] << 8);
  can_putreg(priv, LPC43_CAN_IF1_DB1_OFFSET, regval);

  regval = msg->cm_data[6] + (msg->cm_data[7] << 8);
  can_putreg(priv, LPC43_CAN_IF1_DB2_OFFSET, regval);

#ifdef CONFIG_CAN_EXTID
  can_putreg(priv, LPC43_CAN_IF1_ARB1_OFFSET, id & 0x0000ffff);
  can_putreg(priv, LPC43_CAN_IF1_ARB2_OFFSET, CAN_MSK2_DIR | CAN_MSK2_XTD
                   | CAN_MSK2_MSGVAL | id >> 16);
#else
  can_putreg(priv, LPC43_CAN_IF1_ARB1_OFFSET, 0x0000);
  can_putreg(priv, LPC43_CAN_IF1_ARB2_OFFSET, CAN_MSK2_DIR | CAN_MSK2_MSGVAL
                   | id << 2);
#endif

  regval = (CAN_CMDMSKW_WRRD | CAN_CMDMSKW_MASK |
            CAN_CMDMSKW_ARB | CAN_CMDMSKW_CTRL |
            CAN_CMDMSKW_CLRINTPND | CAN_CMDMSKW_TXRQST |
            CAN_CMDMSKW_DATAA | CAN_CMDMSKW_DATAB);
  can_putreg(priv, LPC43_CAN_IF1_CMDMSKW_OFFSET, regval);

  /* Write to Message RAM */

  can_putreg(priv, LPC43_CAN_IF1_CMDREQ_OFFSET, txobj);

#ifdef CONFIG_CAN_TXREADY
  can_txdone(dev);
#endif

  return OK;
}

/****************************************************************************
 * Name: candev_txready
 *
 * Description:
 *   Return true if the CAN hardware can accept another TX message.
 *
 * Input Parameters:
 *   dev - An instance of the "upper half" can driver state structure.
 *
 * Returned Value:
 *   True if the CAN hardware is ready to accept another TX message.
 *
 ****************************************************************************/

static bool candev_txready(struct can_dev_s *dev)
{
  struct up_dev_s *priv = (struct up_dev_s *)dev->cd_priv;

  if (can_getreg(priv, LPC43_CAN_MSGV2_OFFSET) & 0x8000)
    {
      return false;
    }

  if (can_getreg(priv, LPC43_CAN_IF1_CMDREQ_OFFSET) & CAN_CMDREQ_BUSY)
    {
      return false;
    }

