apache/nuttx/arch/arm/src/lpc43xx/lpc43_can.c
  return true;
}

/****************************************************************************
 * Name: candev_txempty
 *
 * Description:
 *   Return true if all message have been sent.  If for example, the CAN
 *   hardware implements FIFOs, then this would mean the transmit FIFO is
 *   empty.  This method is called when the driver needs to make sure that
 *   all characters are "drained" from the TX hardware before calling
 *   co_shutdown().
 *
 * Input Parameters:
 *   dev - An instance of the "upper half" can driver state structure.
 *
 * Returned Value:
 *   True if there are no pending TX transfers in the CAN hardware.
 *
 ****************************************************************************/

static bool candev_txempty(struct can_dev_s *dev)
{
  struct up_dev_s *priv = (struct up_dev_s *)dev->cd_priv;
  return (!((can_getreg(priv, LPC43_CAN_MSGV2_OFFSET)) & 0xffff));
}

/****************************************************************************
 * Name: can0/1_interrupt
 *
 * Description:
 *   CAN interrupt handler for CAN0 and CAN1.
 *
 * Input Parameters:
 *   irq - The IRQ number of the interrupt.
 *   context - The register state save array at the time of the interrupt.
 *
 * Returned Value:
 *   Zero on success; a negated errno on failure
 *
 ****************************************************************************/

#ifdef CONFIG_LPC43_CAN0
static int can0_interrupt(int irq, void *context, void *arg)
{
  can_interrupt(&g_can0dev);
  return OK;
}
#endif

#ifdef CONFIG_LPC43_CAN1
static int can1_interrupt(int irq, void *context, void *arg)
{
  can_interrupt(&g_can1dev);
  return OK;
}
#endif

/****************************************************************************
 * Name: can_interrupt
 *
 * Description:
 *   CAN interrupt handler.  There is a single interrupt for both CAN0 and
 *   CAN1.
 *
 ****************************************************************************/

static void can_interrupt(struct can_dev_s *dev)
{
  struct up_dev_s *priv = (struct up_dev_s *)dev->cd_priv;
  uint32_t regval = 0;

  uint32_t msgindex = 0;

  /* Read CAN interrupt register */

  uint32_t interrupt = can_getreg(priv, LPC43_CAN_INT_OFFSET);

  /* Read CAN status register */

  uint32_t stat = can_getreg(priv, LPC43_CAN_STAT_OFFSET);

  if (interrupt & CAN_INT_STAT)
    {
      /* Clear all warning/error states except RXOK/TXOK */

      regval = can_getreg(priv, LPC43_CAN_STAT_OFFSET);
      regval &= CAN_STAT_RXOK | CAN_STAT_TXOK;
      can_putreg(priv, LPC43_CAN_STAT_OFFSET, regval);
    }
  else
    {
      msgindex = interrupt & 0x7fff;

      /* if no error detected */

      if (((stat & CAN_STAT_LEC_MASK) == 0) ||
          ((stat & CAN_STAT_LEC_MASK) == CAN_STAT_LEC_MASK))
        {
          if (msgindex <= CAN_RX_OBJ_LAST)
            {
              struct can_hdr_s hdr;
              uint32_t data[2];

              regval = can_getreg(priv, LPC43_CAN_STAT_OFFSET);
              regval &= ~CAN_STAT_RXOK;
              can_putreg(priv, LPC43_CAN_STAT_OFFSET, regval);

              can_readobj(priv, msgindex);
              can_savemsg(priv, &hdr, data);
              can_invalobj(priv, msgindex);
              can_receive(dev, &hdr, (uint8_t *)data);
            }
          else
            {
              regval = can_getreg(priv, LPC43_CAN_STAT_OFFSET);
              regval &= ~CAN_STAT_TXOK;
              can_putreg(priv, LPC43_CAN_STAT_OFFSET, regval);

              can_invalobj(priv, msgindex);
#ifdef CONFIG_CAN_TXREADY
              can_txready(dev);
#else
              can_txdone(dev);
#endif
            }
        }
      else
        {
          can_invalobj(priv, msgindex);
        }

      can_putreg(priv, LPC43_CAN_STAT_OFFSET, 0);

      if (msgindex == CAN_RX_OBJ_LAST)
        {
          can_setuprxobj(priv);
        }
    }
}

/****************************************************************************
 * Name: can_savemsg
 *
 * Description:
 *   Save received message.
 *
 * Input Parameters:
 *   priv - A reference to the CAN block status
 *   hdr - A reference to the message header
 *   data - A reference to the data block
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void can_savemsg(struct up_dev_s *priv, struct can_hdr_s *hdr,
                        uint32_t *data)
{
#ifdef CONFIG_CAN_EXTID
  hdr->ch_id  = (can_getreg(priv, LPC43_CAN_IF2_ARB1_OFFSET) & 0xffff) |
                (can_getreg(priv, LPC43_CAN_IF2_ARB2_OFFSET) & 0x0fff) << 16;
  hdr->ch_extid = 1;
#else
  hdr->ch_id  = (can_getreg(priv, LPC43_CAN_IF2_ARB2_OFFSET) & 0x1fff) >> 2;
#endif
  hdr->ch_dlc = can_getreg(priv, LPC43_CAN_IF2_MCTRL_OFFSET) & 0x000f;
  hdr->ch_rtr = 0;

  data[0]     = can_getreg(priv, LPC43_CAN_IF2_DA2_OFFSET) << 16 |
                can_getreg(priv, LPC43_CAN_IF2_DA1_OFFSET);
  data[1]     = can_getreg(priv, LPC43_CAN_IF2_DB2_OFFSET) << 16 |
                can_getreg(priv, LPC43_CAN_IF2_DB1_OFFSET);
}

/****************************************************************************
 * Name: can_readobj
 *
 * Description:
 *  Transfer Message Object into IF registers.
 *
 * Input Parameters:
 *  priv - A reference to the CAN block status
 *  index - Message Object number
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void can_readobj(struct up_dev_s *priv, uint32_t index)
{
  uint32_t regval;

  while (can_getreg(priv, LPC43_CAN_IF2_CMDREQ_OFFSET) & CAN_CMDREQ_BUSY);

  regval = (CAN_CMDMSKR_MASK | CAN_CMDMSKR_ARB | CAN_CMDMSKR_CTRL |
            CAN_CMDMSKR_CLRINTPND | CAN_CMDMSKR_DATAA | CAN_CMDMSKR_DATAB);
  can_putreg(priv, LPC43_CAN_IF2_CMDMSKR_OFFSET, regval);
  can_putreg(priv, LPC43_CAN_IF2_CMDREQ_OFFSET, index);
}

/****************************************************************************
 * Name: can_invalobj
 *
 * Description:
 *  Invalidate Message Object.
 *
 * Input Parameters:
 *  priv - A reference to the CAN block status
 *  index - Message Object number
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

