apache/nuttx/arch/arm/src/lpc43xx/lpc43_can.c
static void can_invalobj(struct up_dev_s *priv, uint32_t index)
{
  while (can_getreg(priv, LPC43_CAN_IF2_CMDREQ_OFFSET) & CAN_CMDREQ_BUSY);

  can_putreg(priv, LPC43_CAN_IF2_ARB1_OFFSET, 0x0000);
  can_putreg(priv, LPC43_CAN_IF2_ARB2_OFFSET, 0x0000);

  /* Disable reception and transmission interrupts, clear transmit request */

  can_putreg(priv, LPC43_CAN_IF2_MCTRL_OFFSET, CAN_MCTRL_EOB);
  can_putreg(priv, LPC43_CAN_IF2_CMDMSKW_OFFSET,
                   CAN_CMDMSKW_WRRD | CAN_CMDMSKW_CLRINTPND |
                   CAN_CMDMSKW_CTRL | CAN_CMDMSKW_ARB);
  can_putreg(priv, LPC43_CAN_IF2_CMDREQ_OFFSET, index);
}

/****************************************************************************
 * Name: can_setuprxobj
 *
 * Description:
 *  Setup Message Object as buffer for received messages.
 *
 * Input Parameters:
 *  priv - A reference to the CAN block status
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void can_setuprxobj(struct up_dev_s *priv)
{
  uint32_t regval;
  uint8_t i;

  while (can_getreg(priv, LPC43_CAN_IF2_CMDREQ_OFFSET) & CAN_CMDREQ_BUSY);

  can_putreg(priv, LPC43_CAN_IF2_MSK1_OFFSET, 0x0000);
  regval = (CAN_MSK2_MXTD | CAN_MSK2_MDIR);
  can_putreg(priv, LPC43_CAN_IF2_MSK2_OFFSET, regval);

  regval = (CAN_MCTRL_DLC_MASK | CAN_MCTRL_EOB | CAN_MCTRL_RXIE |
            CAN_MCTRL_UMASK);
  can_putreg(priv, LPC43_CAN_IF2_MCTRL_OFFSET, regval);

  can_putreg(priv, LPC43_CAN_IF2_ARB1_OFFSET, 0x0000);
#ifdef CONFIG_CAN_EXTID
  can_putreg(priv, LPC43_CAN_IF2_ARB2_OFFSET,
             CAN_MSK2_MSGVAL | CAN_MSK2_XTD);
#else
  can_putreg(priv, LPC43_CAN_IF2_ARB2_OFFSET, CAN_MSK2_MSGVAL);
#endif

  regval = (CAN_CMDMSKR_WRRD | CAN_CMDMSKR_MASK | CAN_CMDMSKR_ARB |
            CAN_CMDMSKR_CTRL | CAN_CMDMSKR_CLRINTPND | CAN_CMDMSKR_DATAA |
            CAN_CMDMSKR_DATAB);
  can_putreg(priv, LPC43_CAN_IF2_CMDMSKR_OFFSET, regval);

  for (i = CAN_RX_OBJ_FIRST; i <= CAN_RX_OBJ_LAST; ++i)
    {
      while (can_getreg(priv, LPC43_CAN_IF2_CMDREQ_OFFSET) &
             CAN_CMDREQ_BUSY);
      can_putreg(priv, LPC43_CAN_IF2_CMDREQ_OFFSET, i);
    }
}

/****************************************************************************
 * Name: can_bittiming
 *
 * Description:
 *   Set the CAN bit timing register (BTR) based on the configured BAUD.
 *
 * The bit timing logic monitors the serial bus-line and performs sampling
 * and adjustment of the sample point by synchronizing on the start-bit edge
 * and resynchronizing on the following edges.
 *
 * Its operation may be explained simply by splitting nominal bit time into
 * three segments as follows:
 *
 * 1. Synchronization segment (SYNC_SEG): a bit change is expected to occur
 *    within this time segment. It has a fixed length of one time quantum
 *    (1 x tCAN).
 * 2. Bit segment 1 (BS1): defines the location of the sample point. It
 *    includes the PROP_SEG and PHASE_SEG1 of the CAN standard. Its duration
 *    is programmable between 1 and 16 time quanta but may be automatically
 *    lengthened to compensate for positive phase drifts due to differences
 *    in the frequency of the various nodes of the network.
 * 3. Bit segment 2 (BS2): defines the location of the transmit point. It
 *    represents the PHASE_SEG2 of the CAN standard. Its duration is
 *    programmable between 1 and 8 time quanta but may also be automatically
 *    shortened to compensate for negative phase drifts.
 *
 * Pictorially:
 *
 *  |<----------------- NOMINAL BIT TIME ----------------->|
 *  |<- SYNC_SEG ->|<------ BS1 ------>|<------ BS2 ------>|
 *  |<---- Tq ---->|<----- Tbs1 ------>|<----- Tbs2 ------>|
 *
 * Where
 *   Tbs1 is the duration of the BS1 segment
 *   Tbs2 is the duration of the BS2 segment
 *   Tq is the "Time Quantum"
 *
 * Relationships:
 *
 *   baud = 1 / bit_time
 *   bit_time = Tq + Tbs1 + Tbs2
 *   Tbs1 = Tq * ts1
 *   Tbs2 = Tq * ts2
 *   Tq = brp * Tcan
 *
 * Where:
 *   Tcan is the period of the APB clock.
 *
 * Input Parameters:
 *   priv - A reference to the CAN block status
 *
 * Returned Value:
 *   Zero on success; a negated errno on failure
 *
 ****************************************************************************/

static int can_bittiming(struct up_dev_s *priv)
{
  uint32_t ts1 = CONFIG_LPC43_CAN_TSEG1;
  uint32_t ts2 = CONFIG_LPC43_CAN_TSEG2;
  uint32_t sjw = 1;
  uint32_t brp = CAN_CLOCK_FREQUENCY(priv->clkdiv) /
                 (priv->baud * CAN_BIT_QUANTA);

  uint32_t regval;

  canllvdbg("CAN%d PCLK: %d baud: %d\n",
            priv->port, CAN_CLOCK_FREQUENCY(priv->clkdiv), priv->baud);
  canllvdbg("TS1: %d TS2: %d BRP: %d SJW= %d\n", ts1, ts2, brp, sjw);

  /* Start configuring bit timing */

  regval = can_getreg(priv, LPC43_CAN_CNTL_OFFSET);
  regval |= CAN_CNTL_CCE;
  can_putreg(priv, LPC43_CAN_CNTL_OFFSET, regval);

  regval = (((brp - 1) << CAN_BT_BRP_SHIFT)
                     | ((ts1 - 1) << CAN_BT_TSEG1_SHIFT)
                     | ((ts2 - 1) << CAN_BT_TSEG2_SHIFT)
                     | ((sjw - 1) << CAN_BT_SJW_SHIFT));

  canllvdbg("Setting CANxBTR= 0x%08x\n", regval);

  /* Set bit timing */

  can_putreg(priv, LPC43_CAN_BT_OFFSET, regval);

  /* Stop configuring bit timing */

  regval = can_getreg(priv, LPC43_CAN_CNTL_OFFSET);
  regval &= ~CAN_CNTL_CCE;
  can_putreg(priv, LPC43_CAN_CNTL_OFFSET, regval);

  return OK;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: lpc43_caninitialize
 *
 * Description:
 *   Initialize the selected CAN port
 *
 * Input Parameters:
 *   Port number (for hardware that has multiple CAN interfaces)
 *
 * Returned Value:
 *   Valid CAN device structure reference on success; a NULL on failure
 *
 ****************************************************************************/

struct can_dev_s *lpc43_caninitialize(int port)
{
  struct can_dev_s *candev;
  irqstate_t flags;
  uint32_t regval;

  canllvdbg("CAN%d\n", port);

  flags = enter_critical_section();

#ifdef CONFIG_LPC43_CAN0
  if (port == 0)
    {
      /* Enable clock */

      regval = getreg32(LPC43_CCU1_APB3_CAN0_CFG);
      regval |= CCU_CLK_CFG_RUN;
      putreg32(regval, LPC43_CCU1_APB3_CAN0_CFG);

      /* Configure CAN GPIO pins */

      lpc43_pin_config(PINCONF_CAN0_RD);
      lpc43_pin_config(PINCONF_CAN0_TD);

      candev = &g_can0dev;
    }
  else
#endif /* CONFIG_LPC43_CAN0 */

#ifdef CONFIG_LPC43_CAN1
  if (port == 1)
    {
      /* Enable clock */

      regval = getreg32(LPC43_CCU1_APB1_CAN1_CFG);
      regval |= CCU_CLK_CFG_RUN;
      putreg32(regval, LPC43_CCU1_APB1_CAN1_CFG);

      /* Configure CAN GPIO pins */

      lpc43_pin_config(PINCONF_CAN1_RD);
      lpc43_pin_config(PINCONF_CAN1_TD);

      candev = &g_can1dev;
    }
  else
#endif /* CONFIG_LPC43_CAN1 */
    {
      canerr("Unsupported port: %d\n", port);

      leave_critical_section(flags);
      return NULL;
    }

  leave_critical_section(flags);

  return candev;
}
#endif
